Terraform plan for __dev__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_secret.notification_app_secret will be created
  + resource "kubernetes_secret" "notification_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "notification-db-secrets"
          + namespace        = "notification"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_string.notification_user_password will be created
  + resource "random_string" "notification_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["notification"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-dev-db-78c73acd"
      + name      = "notification"
      + project   = "ebo-dev-321910"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["notification-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-dev-db-78c73acd"
      + name     = "notification-user"
      + password = (sensitive value)
      + project  = "ebo-dev-321910"
    }

  # module.inventory_google_postgres.random_id.additional_passwords["notification-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "ibo-dev-db-78c73acd"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #330](https://github.com/ebomart/commerce-infrastructure/actions/runs/1447440977)